/*
 * Project: linux-kit
 * Moudle: Common
 * File: common.h
 * Created Date: 2021-01-28 09:47:44
 * Author: ShiBin
 * Description: description
 * -----
 * todo: modified
 * -----
 * Copyright (c) 2021 - vDiscovery, Inc
 */
#ifndef COMMON_BASE_H
#define COMMON_BASE_H

/* ======================================================================================
 * includes
 */
#include "base.h"

/* ======================================================================================
 * extern
 */
__vd_extern_c_enter__;

/* ======================================================================================
 * macros
 */
#define COMMON_FILE_NREAD_DEFAULT_MAX_LEN (15 * 1024)  // 默认一次读取文件内容的长度

/* ======================================================================================
 * types
 */

/* ======================================================================================
 * declaration
 */

/* ======================================================================================
 * extern
 */
__vd_extern_c_leave__
#endif  //  COMMON_BASE_H
